<template>
<!--<div>Гид по настройке</div>-->
  <div class="col mt-5 mb-5">
    <h4 class="pageSubTitle">{{ pageSubTitle }}</h4>
    <p class="pageDescription mt-4">{{ pageDescription }}</p>
    <div class="guideBox" v-for="guidebox in guideboxes" :key="guidebox.id">
      <div class="d-flex titleWrap align-items-center">
        <span class="mySpan d-flex justify-content-center align-items-center">{{ guidebox.id }}</span>
        <h3 class="guideBoxTitle">{{ guidebox.title }}</h3>
      </div>
      <div class="d-flex">
        <div class="guideBoxBody">{{ guidebox.body1 }}</div>
        <div class="guideBoxBody">{{ guidebox.body2 }}</div>
      </div>
      <CmButton to-next="true" class="base">{{guidebox.caption}}</CmButton>
    </div>
  </div>
</template>

<script>

import CmButton from "../../components/UI/buttons/CmButton";
export default {
  name: "Guide",
  components: {CmButton},
  data() {
    return {
      guideboxes: [
        {
          id: 1,
          caption: 'Перейти к настройке',
          title: 'Синхронизация с CRM системой yclients',
          body1: 'Равным образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий представляет собой интересный эксперимент проверки форм развития.',
          body2: 'Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности влечет за собой процесс внедрения и модернизации соответствующий условий активизации. Равным образом реализация намеченных плановых заданий в значительной степени обуславливает создание существенных финансовых и административных условий.'
        },
        {
          id: 2,
          caption: 'Выбрать тариф',
          title: 'Выбор тарифа оплаты qoob.store',
          body1: '2Равным образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий представляет собой интересный эксперимент проверки форм развития.',
          body2: '2Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности влечет за собой процесс внедрения и модернизации соответствующий условий активизации. Равным образом реализация намеченных плановых заданий в значительной степени обуславливает создание существенных финансовых и административных условий.'
        },
        {
          id: 3,
          caption: 'Перейти к настройке',
          title: 'Настройка уведомлений',
          body1: '2Равным образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий представляет собой интересный эксперимент проверки форм развития.',
          body2: '2Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности влечет за собой процесс внедрения и модернизации соответствующий условий активизации. Равным образом реализация намеченных плановых заданий в значительной степени обуславливает создание существенных финансовых и административных условий.'
        },
        {
          id: 4,
          caption: 'Перейти к настройке',
          title: 'Настройка приложения для клиентов ',
          body1: '2Равным образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий представляет собой интересный эксперимент проверки форм развития.',
          body2: '2Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности влечет за собой процесс внедрения и модернизации соответствующий условий активизации. Равным образом реализация намеченных плановых заданий в значительной степени обуславливает создание существенных финансовых и административных условий.'
        },
        {
          id: 5,
          caption: 'Перейти к материалам',
          title: 'Внедрение, обучение и дополнительные материалы',
          body1: '2Равным образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий представляет собой интересный эксперимент проверки форм развития.',
          body2: '2Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности влечет за собой процесс внедрения и модернизации соответствующий условий активизации. Равным образом реализация намеченных плановых заданий в значительной степени обуславливает создание существенных финансовых и административных условий.'
        },

      ],
      pageSubTitle: 'С чего начать?',
      pageDescription: 'Для корректной работы приложения необходимо произвести настройку систем. Мы поможем вам с настройками.',
    }
  }
}
</script>

<style scoped>
.sectionWrap{
  margin-top: 1.875rem;
  margin-left: 3.75rem;
}
.guideBox {
  background: #FFFFFF;
  box-shadow: 0px 17px 40px rgba(19, 49, 97, 0.07), 0px 6.20528px 21.901px rgba(19, 49, 97, 0.0482987), 0px 3.01255px 10.6325px rgba(19, 49, 97, 0.0389404), 0px 1.47681px 5.21226px rgba(19, 49, 97, 0.0310596);
  border-radius: 1.875rem;
  padding: 3.75rem;
  margin: 0 0 1.25rem 0;
}
.mySpan {
  font-size: 1.75rem;
  font-weight: 500;
  background-color: #FFC549;
  border-radius: 0.75rem;
  width: 2.375rem;
  height: 2.375rem;
  margin-right: 1rem;
}
.pageSubTitle {
  font-style: normal;
  font-weight: 600;
  font-size: 2.5rem;
  line-height: 3.25rem;
  color: #1E2022;
}
.pageDescription {
  font-style: normal;
  font-size: 1.375rem;
  line-height: 2.125rem;
  color: #000000;
  max-width: 50%;
  margin-bottom: 3.75rem;
}
.guideBoxTitle {
  font-style: normal;
  font-weight: 600;
  font-size: 2rem;
  line-height: 2.625rem;
  color: #1E2022;
  margin-bottom: 0;
}
.guideBoxBody {
  font-family: 'Graphik LCG';
  font-style: normal;
  font-weight: normal;
  font-size: 1rem;
  line-height: 1.875rem;
  color: #000000;
  margin-right: 2.375rem;
  margin-bottom: 2.5rem;
}
.titleWrap {
  margin-bottom: 2rem;
}
/*@media screen and (max-width: 1750px){*/
/*  .guideBox{*/
/*    padding: 50px;*/

/*  }*/
/*}*/
</style>
